(function() {
    var py2zi0 = [
    'a:阿啊呵腌,ai:哀哎埃挨唉爱碍艾隘矮蔼癌,an:厂广安氨庵鞍岸按',
    '案暗俺,ang:仰昂肮,ao:袄傲澳懊奥凹拗熬,ba:八巴疤叭芭捌笆扒坝爸',
    '霸把吧伯拔跋罢耙靶,bai:白百摆伯败拜柏掰,ban:办半扮伴瓣绊拌板',
    '版班般斑搬扳颁,bang:帮邦梆绑膀旁磅棒傍谤榜蚌彭,bao:包胞苞褒报',
    '抱爆豹饱宝保炮剥堡雹暴薄刨瀑,bei:贝备倍辈狈惫焙北杯悲碑卑背被',
    '臂勃,ben:本体奔笨夯,beng:蹦泵蚌崩绷,bi:比彼笔鄙匕秕币必毕闭毙',
    '碧蔽弊避壁庇蓖痹璧佛秘泌逼辟鼻荸臂拂,bian:边编鞭蝙变遍辨辩辫',
    '便扁贬匾,biao:表标彪膘,bie:别憋鳖瘪,bin:份宾滨彬缤濒频鬓,bing',
    ':丙柄饼秉禀冰兵并病屏,bo:卜伯佛驳脖博搏膊舶渤拨波玻菠播泊柏',
    '剥薄勃跛簸簿,bu:卜不布步怖部埠补捕哺堡簿,ca:拆擦,cai:才材财裁',
    '采菜彩睬踩猜,can:灿参残蚕惭惨餐掺,cang:仓苍舱沧藏,cao:草槽曹',
    '操糙,ce:册厕测策侧栅,cen:参,ceng:层曾蹭,cha:叉岔衩茶察茬查差',
    '插杈刹喳碴,chai:拆差柴豺,chan:产铲阐单崭馋缠蝉颤掺搀,chang:厂',
    '长场肠尝常偿昌猖畅唱倘倡敞裳淌,chao:抄钞超吵炒朝潮巢绰剿嘲,ch',
    'e:车尺扯彻撤澈,chen:臣尘辰沉陈晨忱沈衬趁称,cheng:成呈诚承城',
    '程惩橙抢净乘秤称盛撑逞铛澄,chi:尺斥赤翅吃嗤痴池驰迟持弛齿耻侈',
    '匙,chong:虫崇冲充种重涌宠,chou:仇丑抽臭绸酬筹稠愁畴,chu:处出',
    '初助除厨锄雏橱础储楚畜触矗,chuai:揣,chuan:川穿传串船喘,chuang',
    ':创闯床疮窗幢,chui:吹炊垂锤捶椎,chun:纯唇醇春椿蠢淳,chuo:绰',
    '戳,ci:此次赐词辞慈磁祠瓷雌刺差伺,cong:从丛匆葱聪囱,cou:凑,cu:',
    '促醋簇粗趋趣卒,cuan:窜篡攒,cui:脆翠悴粹衰催摧崔,cun:寸存村,cu',
    'o:错挫措锉搓撮,da:大打达搭答瘩,dai:大代带贷怠袋逮戴呆隶毒待',
    '歹,dan:丹耽石旦但诞淡蛋氮担单胆弹掸,dang:当挡荡档党铛裆,dao:',
    '刀叨导岛蹈捣祷到盗悼道稻倒,de:地的底得德,dei:得,deng:灯登蹬等',
    '凳邓瞪澄,di:地低堤滴弟抵的底帝递第蒂缔敌笛涤嘀嫡提,dian:电店',
    '垫殿玷淀惦奠典点碘颠掂佃甸,diao:叼雕刁碉吊钓掉调,die:爹跌叠蝶',
    '谍碟,ding:丁订定锭叮盯钉顶鼎,diu:丢,dong:东冬动冻栋洞董懂,dou',
    ':斗抖陡蚪豆逗痘都读兜,du:杜渡妒镀肚毒独牍度都读堵赌睹督,duan',
    ':段断缎锻短端,dui:队对追堆兑敦,dun:吨蹲墩盾顿钝囤盹敦,duo:夺',
    '踱朵躲多哆度惰舵跺垛堕,e:阿恶饿扼遏愕噩鳄鹅额讹俄蛾,en:恩,er:',
    '二贰儿而耳尔饵,fa:乏伐罚阀筏发法,fan:凡烦矾樊反返犯饭泛范贩帆',
    '翻番繁,fang:方芳仿访纺防妨房肪坊放,fei:飞非啡肺废沸费吠肥匪诽',
    '菲,fen:分份坟焚芬吩纷氛奋粪愤忿粉,feng:丰封疯峰锋蜂枫风凤奉讽',
    '逢缝冯,fo:佛,fou:不否,fu:夫父付负妇附咐赴复傅富腹覆赋缚伏扶俘',
    '浮符幅福凫芙袱辐蝠抚斧府俯辅腐甫脯佛肤麸孵敷服副拂,ga:夹咖,ga',
    'i:改该盖溉概丐钙芥,gan:干甘肝竿柑杆秆赶敢感橄乾,gang:冈刚纲',
    '缸肛扛杠岗钢港,gao:告高糕羔篙搞稿镐膏,ge:个各合革阁格隔哥鸽割',
    '歌戈胳搁盖葛疙蛤,gei:给,gen:根跟,geng:更耕羹颈埂耿梗,gong:工',
    '弓公功攻宫恭躬巩汞拱红贡供共蚣,gou:勾句沟钩拘构购够垢狗苟,gu:',
    '古谷股鼓估固故顾雇孤姑辜咕沽菇箍骨贾,gua:瓜刮挂卦褂括寡,guai:',
    '拐乖怪,guan:关官棺观冠贯惯灌罐馆管,guang:广光逛,gui:归规闺硅',
    '瑰轨鬼诡龟柜贵桂跪刽傀,gun:棍滚,guo:过果裹国锅郭涡,ha:哈蛤,ha',
    'i:还咳孩海害亥骇,han:厂汉旱捍悍焊撼翰憾汗含寒函涵韩喊罕酣憨,',
    'hang:行巷航杭夯吭,hao:号好耗浩毫豪壕嚎蒿,he:禾河荷盒吓合何和',
    '贺赫褐鹤核盖喝苛呵,hei:黑嘿,hen:很狠恨痕,heng:恒衡横哼,hong:',
    '红宏虹洪鸿轰烘哄,hou:后厚候吼喉猴侯,hu:互户护沪乎呼忽许戏虎和',
    '狐胡壶湖蝴弧葫核糊唬,hua:化划华花画话桦哗猾滑豁,huai:坏怀槐徊',
    '淮,huan:幻换唤患宦涣焕痪欢还环缓,huang:荒慌皇黄煌凰惶蝗蟥晃谎',
    '恍幌,hui:汇绘贿惠慧讳诲晦秽灰挥恢辉徽回茴蛔会悔毁堕溃,hun:昏',
    '婚荤浑魂混棍,huo:火伙或货获祸惑霍和活豁,ji:几及吉级极即急疾集',
    '籍棘辑嫉己挤脊计记技忌际季剂迹既继寄绩妓荠寂鲫冀击饥圾机肌鸡',
    '积基激讥叽唧畸箕齐纪济系其奇给期祭稽,jia:甲钾加佳嘉枷夹价驾架',
    '嫁稼家假挟荚颊贾,jian:见尖奸歼坚肩艰兼煎件建荐贱剑健舰践鉴键',
    '箭涧间监拣茧俭捡检减剪简柬碱浅渐溅,jiang:匠酱江姜僵缰讲奖桨蒋',
    '降将浆港强疆,jiao:叫轿较窖酵交郊浇娇骄胶椒焦蕉礁角狡饺绞脚搅',
    '觉校教缴嚼侥矫剿,jie:皆阶接街秸介戒届界借诫节结价她劫杰洁捷截',
    '竭姐家揭解芥楷,jin:巾斤今金津筋襟仅尽进近晋浸劲紧锦谨禁,jing:',
    '井警阱劲茎京经惊晶睛精荆兢鲸径竞竟敬静境镜靖净颈景,jiong:窘,j',
    'iu:九久酒玖灸韭旧救就舅臼疚纠究揪鸠,ju:车巨拒具俱剧距惧锯聚',
    '炬且句局菊橘拘柜居鞠驹矩举据渠沮,juan:卷捐鹃倦绢眷圈,jue:决绝',
    '掘诀爵角觉嚼倔,jun:军均君钧龟俊峻骏竣菌,ka:卡咖,kai:开揩岂凯',
    '慨楷,kan:刊堪勘砍坎看嵌,kang:扛抗炕康糠慷,kao:考烤拷靠铐,ke:',
    '可壳克刻客课咳科棵颗磕蝌渴坷苛呵,ken:肯垦恳啃,keng:坑吭,kong:',
    '孔恐空控,kou:口扣寇抠,ku:库裤酷苦挎枯哭窟,kua:夸垮挎跨胯,kuai',
    ':会块快筷,kuan:宽款,kuang:旷况矿框眶狂筐,kui:亏盔窥葵魁愧傀',
    '溃,kun:困昆坤捆,kuo:扩阔廓括,la:垃拉啦落喇腊蜡辣,lai:来莱赖癞',
    ',lan:兰拦栏蓝篮澜览懒揽缆榄烂滥,lang:郎狼廊琅榔浪朗,lao:老劳',
    '牢姥络捞涝酪落唠烙潦,le:了乐勒肋,lei:泪类垒蕾儡勒累雷肋擂,len',
    'g:冷棱楞,li:力历厉立励利例栗粒吏沥荔俐莉砾雳痢礼李里理鲤丽隶',
    '厘狸离犁梨璃黎漓篱哩,lia:俩,lian:连怜帘莲联廉镰练炼恋链脸敛,l',
    'iang:两良梁粮粱亮谅辆晾凉量,liao:了辽疗僚聊寥嘹缭料镣撩潦燎',
    '瞭,lie:列劣烈猎裂咧,lin:邻林临琳磷鳞淋吝赁躏凛檩,ling:另令伶',
    '灵铃陵零龄玲凌菱蛉翎岭领棱,liu:六刘留流榴琉硫瘤柳碌溜馏,long:',
    '龙聋隆咙胧窿弄拢垄笼,lou:搂楼娄漏陋露篓,lu:六芦炉卢庐颅陆录鹿',
    '路赂虏鲁卤绿碌露,luan:乱卵峦,lun:论轮仑伦沦抡,luo:罗萝锣箩骡',
    '螺逻骆洛络落烙啰裸,lv:驴律虑滤氯旅屡吕侣铝缕履率绿,lve:掠略,m',
    'a:么马码玛吗妈抹蚂骂麻摩蟆,mai:迈麦卖买脉埋,man:埋蛮馒满漫慢',
    '曼幔瞒蔓,mang:芒忙盲茫氓莽,mao:毛矛茅锚茂贸帽貌冒猫铆,me:么,m',
    'ei:每美没妹昧媚眉梅煤霉玫枚媒楣糜,men:门们闷瞒,meng:孟梦萌盟',
    '檬朦猛锰蒙氓,mi:米迷谜靡秘泌眯密蜜觅弥咪糜,mian:免勉娩冕缅面',
    '眠绵棉,miao:妙庙苗描瞄秒渺藐,mie:灭蔑,min:民敏皿闽悯,ming:名',
    '明鸣铭螟命,miu:谬,mo:万么末沫漠墨默茉陌寞没抹冒脉莫摸模膜魔馍',
    '摹蘑摩磨嘿蟆,mou:某谋,mu:木目牧墓幕暮慕沐募睦穆母亩牡拇姆姥莫',
    '模,na:内那纳钠捺南哪拿呐娜,nai:乃奶耐奈能,nan:男南难,nang:囊,',
    'nao:闹挠恼脑,ne:呢哪呐,nei:内那哪馁,nen:嫩,neng:能,ni:尼你拟',
    '呢泥逆昵匿腻疑溺,nian:年念捻蔫撵碾,niang:娘酿,niao:鸟尿溺,nie',
    ':捏摄聂镊孽捻,nin:您,ning:宁凝狞柠拧泞,niu:牛扭纽钮拗,nong:',
    '农浓脓弄,nu:奴努怒,nuan:暖,nuo:挪难娜诺懦糯,nv:女,nve:疟虐,ou',
    ':区欧殴鸥偶藕呕,pa:扒爬怕帕趴耙,pai:拍迫派湃排牌徘,pan:判盼',
    '叛畔拌盘番攀潘,pang:乓胖旁磅庞螃,pao:抛泡炮袍咆跑刨,pei:坏佩',
    '配沛陪培赔胚,pen:盆喷,peng:苹朋棚蓬膨硼鹏澎篷捧碰砰烹彭,pi:匹',
    '皮疲脾啤坏批披坯霹否罢被副辟僻屁譬劈,pian:片便扁偏篇翩骗,piao',
    ':朴票漂飘瓢,pie:撇,pin:贫拼品聘频,ping:平评凭瓶萍坪乒苹冯屏,',
    'po:朴坡泼颇迫泊破魄婆繁,pou:剖,pu:仆扑朴葡菩蒲铺堡普谱圃浦暴',
    '瀑,qi:七戚欺漆柒凄嘁乞企启起气弃汽器迄泣岂齐其奇枝妻砌骑棋旗',
    '歧祈脐畦崎鳍揭期契栖稽,qia:卡洽恰掐,qian:千迁牵谦签欠歉纤浅前',
    '钱钳潜黔铅遣谴乾嵌,qiang:抢枪腔强墙疆呛,qiao:巧乔侨桥瞧荞憔壳',
    '悄雀锹敲跷俏峭窍撬翘,qie:切且茄砌窃怯契,qin:芹琴禽勤秦擒侵钦',
    '亲寝,qing:庆青轻倾清蜻氢卿顷请亲情晴擎,qiong:穷琼,qiu:仇丘秋',
    '蚯求球囚龟,qu:区去曲驱屈岖蛆躯取娶渠趋趣,quan:犬劝权全泉拳痊',
    '券圈,que:却确鹊缺雀瘸,qun:裙群,ran:染然燃,rang:让壤攘嚷瓤,rao',
    ':扰饶绕,re:若热惹,ren:人仁刃认韧纫任忍,reng:仍扔,ri:日,rong:',
    '荣绒容熔融茸蓉溶榕冗,rou:肉柔揉蹂,ru:入褥女如儒蠕乳辱,ruan:软',
    ',rui:锐瑞兑蕊,run:润闰,ruo:若弱,sa:洒撒飒萨,sai:思塞赛腮,san',
    ':三叁伞参散,sang:丧桑嗓,sao:扫梢嫂搔骚臊,se:色涩瑟塞,sen:森,',
    'seng:僧,sha:杀纱杉砂沙煞厦傻刹啥霎,shai:晒筛,shan:山删衫珊闪',
    '陕单扇苫善擅膳赡栅掺掸,shang:上伤商汤尚晌赏裳,shao:勺芍少召绍',
    '哨捎稍烧梢,she:舌设社舍涉赦折拾射蛇摄奢赊,shen:什申伸身深呻绅',
    '沈肾渗慎审婶参甚信神,sheng:升生声牲笙甥圣胜剩省乘盛绳甸,shi:',
    '十时实蚀士示世市式势事侍饰试视柿是适室逝释誓拭恃嗜尸失师诗狮',
    '施湿虱什氏石史使始驶矢屎似识泽拾食匙殖栅硕,shou:手守首收寿受',
    '授售兽瘦,shu:书叔殊梳舒疏输蔬抒枢淑术朱束述树竖恕庶墅漱暑鼠薯',
    '黍蜀署曙属数熟秫赎,shua:刷耍,shuai:帅蟀甩衰率摔,shuan:拴栓涮,',
    'shuang:双霜爽,shui:水说谁税睡,shun:顺瞬吮,shuo:说数烁硕,si:',
    '四寺饲肆司丝私斯撕嘶死似思食伺,song:宋送诵颂讼松耸,sou:搜艘嗽',
    ',su:苏诉肃素速塑粟溯俗宿缩酥,suan:蒜算酸,sui:岁碎穗祟遂隧尿',
    '虽随髓,sun:孙损笋,suo:些所索锁琐缩唆梭嗦,ta:他它塌她塔踏蹋拓,',
    'tai:大太态泰汰台苔抬胎,tan:叹炭探碳坛谈痰昙谭潭檀坦毯袒贪摊',
    '滩瘫弹,tang:汤倘唐堂塘膛糖棠搪烫趟躺淌,tao:叨讨逃桃陶萄淘套涛',
    '掏滔跳,te:特,teng:疼腾誊藤,ti:体弟剃惕替屉涕梯踢剔提题蹄啼,ti',
    'an:天添田甜恬填佃甸舔,tiao:条挑调跳笤,tie:帖贴铁,ting:厅听挺',
    '艇亭庭停蜓廷,tong:同统桶筒捅桐铜童彤瞳通痛,tou:头投透偷愉,tu:',
    '土吐秃突凸图徒途涂屠兔,tuan:团揣,tui:弟退蜕推腿颓褪,tun:屯吞',
    '囤褪臀,tuo:托拖脱妥椭驼驮鸵拓唾,wa:瓦挖蛙洼娃袜凹,wai:外歪,wa',
    'n:万丸完玩顽弯湾豌挽晚碗惋婉宛腕蔓,wang:亡王网往枉妄忘旺望汪',
    ',wei:卫未位味畏胃喂慰谓猬蔚魏为伟伪苇纬萎危威微偎薇巍违围唯',
    '维桅尾委尉,wen:文闻蚊问纹温瘟稳吻紊,weng:翁嗡瓮,wo:我沃卧握窝',
    '蜗涡,wu:亡无吴芜梧蜈五午伍武侮舞捂鹉勿务物误悟雾坞晤乌污呜屋',
    '巫诬恶,xi:夕西吸希析牺息悉惜稀锡溪熄膝昔晰犀熙嬉蟋习席袭媳戏',
    '系细隙洒洗喜徙腊栖铣,xia:下夏夹吓虾瞎峡狭霞匣侠暇辖厦唬,xian:',
    '见仙先掀锨纤县闲贤弦咸衔嫌涎舷现限线宪陷馅羡献腺显险洗鲜掺铣,',
    'xiang:乡香箱厢湘镶向项象像橡羊享响想详降巷相祥翔,xiao:小晓孝',
    '笑效哮啸削校消宵销萧硝箫嚣肖俏淆,xie:叶写协胁斜携鞋谐邪血些泄',
    '泻卸屑械谢懈蟹歇楔蝎解契挟,xin:心辛欣新薪锌信芯衅,xing:刑形型',
    '邢行兴杏幸性姓省星腥猩醒,xiong:凶兄胸匈汹雄熊,xiu:朽休秀袖绣',
    '锈嗅修羞臭宿,xu:邪休许序叙绪续絮蓄旭恤酗婿须虚需徐畜吁,xuan:',
    '县券选癣宣轩喧悬玄漩旋炫,xue:穴学血削雪靴薛,xun:训讯迅汛驯逊',
    '殉旬寻巡询循孙勋熏,ya:牙芽崖蚜涯衙轧亚讶压邪呀押鸦鸭哑雅,yan:',
    '厌艳宴验雁焰砚唁谚堰延严言岩炎沿盐颜阎蜒檐研咽铅烟淹掩眼演衍',
    '燕奄殷腌,yang:央殃秧鸯扬阳杨洋仰羊详养氧痒样漾,yao:么约妖腰邀',
    '夭吆药耀要咬舀钥窑谣摇遥肴姚侥疟,ye:也冶野业页夜液谒腋叶邪爷',
    '咽射喝掖椰,yi:乙已以蚁倚一衣医依伊揖壹亿义艺忆议亦异役译易疫',
    '益谊意毅翼屹抑邑绎奕逸肄溢仪宜姨移遗夷胰尾泄食射蛇椅蛾疑疙,yi',
    'n:引饮蚓瘾印因阴音姻茵银吟淫隐殷,ying:迎盈营蝇赢荧莹萤应英樱',
    '鹰莺婴缨鹦映硬景影颖,yo:哟,yong:用永咏泳勇蛹踊佣拥庸涌,you:又',
    '右幼诱佑友尤由邮犹油游有优忧悠幽,yu:于余鱼娱渔榆愚隅逾舆与予',
    '玉育狱浴预域欲遇御裕愈誉芋郁喻寓豫邪屿宇羽雨语奥愉粥迂淤吁尉,',
    'yuan:元园原圆援缘源袁猿辕远员怨院愿冤鸳渊宛,yue:月阅悦跃越岳',
    '粤乐约钥说兑,yun:云匀耘允陨孕运韵酝蕴员晕,za:扎杂砸咱,zai:仔',
    '再在灾栽载宰,zan:咱暂赞攒,zang:脏葬藏赃,zao:早枣澡蚤藻皂灶造',
    '燥躁噪遭糟凿,ze:则责择侧泽,zei:贼,zen:怎,zeng:曾增憎赠综,zha:',
    '扎闸铡查眨炸渣榨乍诈栅喳,zhai:齐宅择侧债寨窄摘斋祭,zhan:占斩',
    '盏展沾粘毡瞻战站栈绽蘸崭颤,zhang:丈仗帐胀障杖账长张章彰樟涨掌',
    ',zhao:爪召兆赵照罩找沼招昭着朝嘲,zhe:折这者哲辙浙蔗著着遮,zh',
    'ei:这,zhen:贞针侦珍真斟榛阵振震镇诊枕疹填,zheng:丁正症挣争征',
    '睁筝蒸怔狰证郑政整拯,zhi:之支汁芝肢脂蜘止旨址纸指趾氏只执直侄',
    '值职植至志帜制质治致秩智置挚掷窒滞稚识枝知织殖吱拓,zhong:中众',
    '仲忠终钟盅衷肿种重蚣,zhou:舟州周洲宙昼皱骤咒调粥肘帚轴,zhu:术',
    '主煮嘱拄宁朱竹逐烛助住注驻柱祝铸贮蛀珠株诸猪蛛著筑属,zhua:爪',
    '抓,zhuai:转,zhuan:专砖传转赚撰,zhuang:壮状撞庄装妆桩幢,zhui:',
    '追坠缀赘揣椎锥,zhun:屯准谆淳,zhuo:浊啄灼茁卓酌捉桌拙著着缴琢,',
    'zi:子紫姊籽滓仔自字齐姿资滋咨吱,zong:从纵宗棕踪总综,zou:走奏',
    '揍,zu:足族阻组祖诅租卒,zuan:钻,zui:最罪醉嘴,zun:尊遵,zuo:左作',
    '坐座做昨琢撮'];

    var zi2py = {};
    var py2zi1;
    var pz,i,j;
    
    py2zi1 = py2zi0.join('').split(',');
    for (i=0; i<py2zi1.length; i++) {
        pz = py2zi1[i].split(':');
        for (j=0; j<pz[1].length; j++) {
            zi2py[pz[1][j]] = pz[0];
        }
    }
    
    function pinyin(str) {
        var pys = [], shengmus = [], poss = [];
        var py, ch, pos=0;
        var i;
    
        if (typeof str != 'string')
            return {hasHanzi: false};
        for (i=0; i<str.length; i++) {
            poss.push(pos);
            ch = str[i];
            py = zi2py[ch];
            if (py) {
                pys.push(py);
                shengmus.push(py[0]);
                pos += py.length;
            } else {
                pys.push(ch);
                shengmus.push(ch);
                pos++;
            }
        }
    
        if (pys.length > 0) {
            return {
                hasHanzi: true,
                pinyin: pys.join(''),
                acronym: shengmus.join(''),
                pos: poss,
            };
        } else {
            return {hasHanzi: false};
        }
    }
    
    if (typeof window != 'undefined') {
        window.txpinyin = pinyin;
    } else if (typeof module != 'undefined') {
        module.exports = pinyin;
    }

})();
