var express = require('express');
var router = express.Router();

/* GET home page. */
router.get('/', function(req, res, next) {
  var data = {
    title: '每日签到 - 最简单易用的习惯养成工具',
    version: 12,
    habbits: [
      {
        id: 1,
        name: '每天跑步半小时',
        workday: [1,2,3,4,5,6],
        'checkin-count': 89,
        checkins: {
          '2015-09': [1,1,1,1,1,1,1,1,1,1,
                      1,1,1,1,1,1,1,1,1,1,
                      0,1,1,1,1,1,1,1,1,0],
          '2015-10': [1,1,1,0,1,1,1,1,0,0,
                      0,0,0,0,0,0,0,0,0,0,
                      0,0,0,0,0,0,0,0,0,0,
                      0],
          '2015-11': [0,0,0,0,0,0,0,0,0,0,
                      0,0,0,0,0,0,0,0,0,0,
                      0,0,0,0,0,0,0,0,0,0],

        },
      },
      {
        id: 2,
        name: '每天11:30前睡觉',
        workday: [1,2,3,4,5,6,7],
        'checkin-count': 40,
        checkins: {
          '2015-09': [0,0,0,0,0,0,0,1,1,1,
                      1,1,1,0,0,0,1,0,0,0,
                      0,0,1,0,0,0,0,0,1,0],
          '2015-10': [1,0,1,0,1,1,0,0,0,0,
                      0,0,0,0,0,0,0,0,0,0,
                      0,0,0,0,0,0,0,0,0,0,
                      0],
          '2015-11': [0,0,0,0,0,0,0,0,0,0,
                      0,0,0,0,0,0,0,0,0,0,
                      0,0,0,0,0,0,0,0,0,0],

        },
      },
    ],
  };
  res.render('index', data);
});

router.get('api

module.exports = router;
